# Encoding --> using this mehtod , we can convert the categorical data to the numerical data.
# its  has 4 types of the encoding
1. LabelEncoding -> Transform categorical data into numerical data but it will work only single -single columns. it will automatically decide wgihc alue pass to the whihc sub-category
2. OrdinalEncoding--> Transform categorical data into numerical data but it will work on the multiple comlums. it will automatically decoding which values pas to the which sub-category.
3. OneHotEncoding-> Transform categorical data into nuerical data but it will create new colum based on sub-category which you mentioned in your columms. It will not provide

# you column name 
# coulns surided(yes,no) -> surived_Yes, Survie_no

$. get_dommies--> Transform categorical data into Numerical data but it will cate new colums based on sub_category which you mentioned in your columns
but it will provide you columns name also

# 1. LableEncoding

In [103]:
import pandas as pd
import numpy as np

In [104]:
df=pd.read_csv('Social_Network_Ads.csv')

In [105]:
df.sample(1)

      User ID Gender  Age  EstimatedSalary  Purchased
296  15673539   Male   42            73000          1

In [106]:
# first check the missing value
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [107]:
# importing the simple impurators 
from sklearn.impute import SimpleImputer

In [108]:
s1=SimpleImputer()

In [109]:
# if incash comes the null missing value to remove
#df['colums_name_have']=s1.fit_transform(df['columns_name']])

In [110]:
# againg check the null value

In [111]:
df.head(2)

    User ID Gender  Age  EstimatedSalary  Purchased
0  15624510   Male   19            19000          0
1  15810944   Male   35            20000          0

In [112]:
# now have the both  typed data categorical and numerical data..

In [113]:
from sklearn.preprocessing import LabelEncoder

In [114]:
lb=LabelEncoder()

In [115]:
# df.value_counts

In [116]:
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [117]:
df['Gender']=lb.fit_transform(df['Gender'])
df['Age']=lb.fit_transform(df['Age'])
df['EstimatedSalary']=lb.fit_transform(df['EstimatedSalary'])
df['Purchased']=lb.fit_transform(df['Purchased'])

In [118]:
df.sample(3)

      User ID  Gender  Age  EstimatedSalary  Purchased
366  15574372       0   40               30          1
369  15624755       0   36               10          1
180  15685576       1    8                1          0

# After this proces Standarition and Normalizations

In [119]:
df.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [120]:
x=df.drop(columns=['Purchased'])
y=df['Purchased']

In [121]:
from sklearn.model_selection import train_test_split

In [122]:
x_train, x_test, y_train, y_test=train_test_split(x,y,test_size=0.2,random_state=42)

In [123]:
from sklearn.preprocessing import StandardScaler

In [124]:
sc=StandardScaler()

In [125]:
x_train_sc=sc.fit_transform(x_train)

In [126]:
x_train_new=pd.DataFrame(x_train_sc,columns=x_train.columns)

In [127]:
np.round(x_train.describe(),2)

           User ID  Gender     Age  EstimatedSalary
count       320.00   320.0  320.00           320.00
mean   15689066.37     0.5   19.87            50.58
std       71974.25     0.5   10.21            30.06
min    15569641.00     0.0    0.00             0.00
25%    15622771.00     0.0   12.00            26.00
50%    15689969.50     0.5   19.00            52.00
75%    15747470.00     1.0   27.00            69.00
max    15815236.00     1.0   42.00           116.00

# 1. LableEncoding

In [128]:
df=pd.read_csv('insurance.csv')
df.sample(2)

      age   sex    bmi  children smoker     region     charges
1317   18  male  53.13         0     no  southeast   1163.4627
685    53  male  26.41         2     no  northeast  11244.3769

In [129]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [130]:
# performe the lableEncode
from sklearn.preprocessing import LabelEncoder

In [131]:
lb=LabelEncoder()

In [132]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [133]:
df['age']=lb.fit_transform(df['age'])
df['sex']=lb.fit_transform(df['sex'])
df['bmi']=lb.fit_transform(df['bmi'])
df['children']=lb.fit_transform(df['children'])
df['smoker']=lb.fit_transform(df['smoker'])
df['charges']=lb.fit_transform(df['charges'])

In [134]:
df.head(3)

   age  sex  bmi  children  smoker     region  charges
0    1    0  197         0       1  southwest     1005
1    0    1  350         1       0  southeast       57
2   10    1  331         3       0  southeast      306

In [135]:
# removing the colums onces
x=df.drop(columns=['region'])
y=df['region']

In [136]:
x_train,x_test,y_train, y_test=train_test_split(x,y,test_size=0.2,random_state=42)

# applying the normalization processs

In [137]:
from sklearn.preprocessing import MinMaxScaler

In [138]:
mn=MinMaxScaler()

In [139]:
x_train_mn=mn.fit_transform(x_train)

In [140]:
x_train_new=pd.DataFrame(x_train_mn,columns=x_train.columns)

In [141]:
np.round(x_train_new.describe(),2)

           age      sex      bmi  children   smoker  charges
count  1070.00  1070.00  1070.00   1070.00  1070.00  1070.00
mean      0.46     0.51     0.48      0.22     0.21     0.51
std       0.31     0.50     0.25      0.24     0.40     0.29
min       0.00     0.00     0.00      0.00     0.00     0.00
25%       0.20     0.00     0.28      0.00     0.00     0.26
50%       0.47     1.00     0.48      0.20     0.00     0.51
75%       0.72     1.00     0.67      0.40     0.00     0.75
max       1.00     1.00     1.00      1.00     1.00     1.00

# Ordinal Encoding 

convet multiple comlumns categorical to numerical data

In [234]:
df=pd.read_csv('bank_transactions_data_2.csv')

In [235]:
df.head()

,TransactionID,AccountID,TransactionAmount,TransactionDate,TransactionType,Location,DeviceID,IP Address,MerchantID,Channel,CustomerAge,CustomerOccupation,TransactionDuration,LoginAttempts,AccountBalance,PreviousTransactionDate
0,TX000001,AC00128,14.09,4/11/2023 16:29,Debit,San Diego,D000380,162.198.218.92,M015,ATM,70,Doctor,81,1,5112.21,11/4/2024 8:08
1,TX000002,AC00455,376.24,6/27/2023 16:44,Debit,Houston,D000051,13.149.61.4,M052,ATM,68,Doctor,141,1,13758.91,11/4/2024 8:09
2,TX000003,AC00019,126.29,7/10/2023 18:16,Debit,Mesa,D000235,215.97.143.157,M009,Online,19,Student,56,1,1122.35,11/4/2024 8:07
3,TX000004,AC00070,184.50,5/5/2023 16:32,Debit,Raleigh,D000187,200.13.225.150,M002,Online,26,Student,25,1,8569.06,11/4/2024 8:09
4,TX000005,AC00411,13.45,10/16/2023 17:51,Credit,Atlanta,D000308,65.164.3.100,M091,Online,26,Student,198,1,7429.40,11/4/2024 8:06

In [236]:
df=df.drop(columns=['TransactionID', 'AccountID', 'TransactionAmount','TransactionDate','DeviceID','IP Address','MerchantID','CustomerAge','TransactionDuration','LoginAttempts','AccountBalance','PreviousTransactionDate'])
# remove all the numerical data form this dataset

In [237]:
df=df.drop(columns=['Location'])
df=df.drop(columns=['TransactionType'])

df.head()

  Channel CustomerOccupation
0     ATM             Doctor
1     ATM             Doctor
2  Online            Student
3  Online            Student
4  Online            Student

In [238]:
df.columns

Index(['Channel', 'CustomerOccupation'], dtype='object')

In [239]:
df.isnull().sum()

Channel               0
CustomerOccupation    0
dtype: int64

In [240]:
# df['Number of Urban Hospitals (Govt.)']=s1.fit_transform(df['Number of Urban Hospitals (Govt.)'])
df.head()

  Channel CustomerOccupation
0     ATM             Doctor
1     ATM             Doctor
2  Online            Student
3  Online            Student
4  Online            Student

In [241]:
df = pd.DataFrame(df)

In [242]:
from sklearn.preprocessing import OrdinalEncoder

In [245]:
# Clean whitespace from all string columns
# df = df.apply(lambda col: col.str.strip() if col.dtype == "object" else col)

In [246]:
oe = OrdinalEncoder(categories=[['Doctor','Student'],
                                ['ATM','Online']])

In [ ]:
oe_sc=oe.fit_transform(df)

In [248]:
new_df=pd.DataFrame(oe_sc,columns=df.columns)
new_df

NameError: name 'oe_sc' is not defined

In [ ]:
# comverting floting to inter
new_df=new_df.astype(int)
new_df.head()